Refactored the readme
